package p02.lecture;

public class A03TypeByte {
	public static void main(String[] args) {
		//byte : 1byte 크기의 정수를 저장할 수 있음
		//1byte == 8bite
		//0000 0000 ~ 1111 1111
		
		//십진법 0 == 2진법 0000 0000
		//십진법 1 == 2진법 0000 0001
		//십진법 2 == 2진법 0000 0010
		//십진법 3 == 2진법 0000 0011
		// ....
		//십진법 127 == 2진법 0111 1111
		//       -128 == 1000 0000 //맨 왼쪽비트가 1이면 음수
		//       -127 == 1000 0001
		//       -126 == 1000 0010
		// .......
		//         -1 == 1111 1111
		//          0 ==10000 0000 -> bite 는 8자리여서 앞의 1이 사라짐
		//            -> 0000 0000
		
		//최소값: -128
		//최댓값: 127
		
		byte byteVar;
		byteVar = -128;
		byteVar = 127;
//		byteVar = -129; //not ok
//		byteVar = 128; // not ok
	}
}
